#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mgoogle_compute_firewall.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/global/firewalls/xlb-poc01][0m
[0m[1mgoogle_compute_health_check.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/global/healthChecks/xlb-poc01][0m
[0m[1mgoogle_compute_global_address.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/global/addresses/xlb-poc01][0m
[0m[1mgoogle_compute_instance.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/zones/us-central1-a/instances/xlb-poc01][0m
[0m[1mgoogle_compute_instance_group.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/zones/us-central1-a/instanceGroups/xlb-poc01][0m
[0m[1mgoogle_compute_backend_service.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/global/backendServices/xlb-poc01][0m
[0m[1mgoogle_compute_url_map.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/global/urlMaps/xlb-poc01][0m
[0m[1mgoogle_compute_target_http_proxy.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/global/targetHttpProxies/xlb-poc01][0m
[0m[1mgoogle_compute_global_forwarding_rule.this: Refreshing state... [id=projects/playground-s-11-28ca33cd/global/forwardingRules/xlb-poc01][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # google_compute_firewall.this[0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "google_compute_firewall" "this" {
        [1m[0mid[0m[0m                      = "projects/playground-s-11-28ca33cd/global/firewalls/xlb-poc01"
        [1m[0mname[0m[0m                    = "xlb-poc01"
      [32m+[0m [0m[1m[0msource_service_accounts[0m[0m = []
      [32m+[0m [0m[1m[0msource_tags[0m[0m             = []
      [32m+[0m [0m[1m[0mtarget_service_accounts[0m[0m = []
      [32m+[0m [0m[1m[0mtarget_tags[0m[0m             = []
        [90m# (9 unchanged attributes hidden)[0m[0m


        [90m# (2 unchanged blocks hidden)[0m[0m
    }
[1m  # google_compute_instance.this[0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "google_compute_instance" "this" {
        [1m[0mid[0m[0m                      = "projects/playground-s-11-28ca33cd/zones/us-central1-a/instances/xlb-poc01"
      [32m+[0m [0m[1m[0mlabels[0m[0m                  = {}
      [32m+[0m [0m[1m[0mmetadata[0m[0m                = {}
        [1m[0mname[0m[0m                    = "xlb-poc01"
      [32m+[0m [0m[1m[0mresource_policies[0m[0m       = []
      [32m+[0m [0m[1m[0mtags[0m[0m                    = []
        [90m# (15 unchanged attributes hidden)[0m[0m



        [90m# (3 unchanged blocks hidden)[0m[0m
    }
[1m  # google_compute_backend_service.this[0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "google_compute_backend_service" "this" {
      [32m+[0m [0m[1m[0mcustom_request_headers[0m[0m          = []
      [32m+[0m [0m[1m[0mcustom_response_headers[0m[0m         = []
      [33m~[0m [0m[1m[0mhealth_checks[0m[0m                   = [
          [32m+[0m [0m"https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/healthChecks/xlb-poc01",
          [31m-[0m [0m"projects/playground-s-11-28ca33cd/global/healthChecks/xlb-poc01",
        ]
        [1m[0mid[0m[0m                              = "projects/playground-s-11-28ca33cd/global/backendServices/xlb-poc01"
        [1m[0mname[0m[0m                            = "xlb-poc01"
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }
[1m  # google_compute_global_forwarding_rule.this[0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "google_compute_global_forwarding_rule" "this" {
        [1m[0mid[0m[0m                    = "projects/playground-s-11-28ca33cd/global/forwardingRules/xlb-poc01"
      [32m+[0m [0m[1m[0mlabels[0m[0m                = {}
        [1m[0mname[0m[0m                  = "xlb-poc01"
        [90m# (8 unchanged attributes hidden)[0m[0m
    }
[1m  # google_compute_instance_group.this[0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "google_compute_instance_group" "this" {
        [1m[0mid[0m[0m        = "projects/playground-s-11-28ca33cd/zones/us-central1-a/instanceGroups/xlb-poc01"
      [33m~[0m [0m[1m[0minstances[0m[0m = [
          [32m+[0m [0m"https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/zones/us-central1-a/instances/xlb-poc01",
          [31m-[0m [0m"projects/playground-s-11-28ca33cd/zones/us-central1-a/instances/xlb-poc01",
        ]
        [1m[0mname[0m[0m      = "xlb-poc01"
        [90m# (5 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # google_compute_backend_service.this[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_compute_backend_service" "this" {
      [31m-[0m [0m[1m[0maffinity_cookie_ttl_sec[0m[0m         = 0 [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mcreation_timestamp[0m[0m              = "2021-11-06T15:50:49.256-07:00" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mcustom_request_headers[0m[0m          = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcustom_response_headers[0m[0m         = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_cdn[0m[0m                      = false [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mfingerprint[0m[0m                     = "9p7hxWpqTzQ=" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mhealth_checks[0m[0m                   = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/healthChecks/xlb-poc01",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                              = "projects/playground-s-11-28ca33cd/global/backendServices/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                            = "xlb-poc01" [33m->[0m [0m"xlb-poc02" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mport_name[0m[0m                       = "xlb-poc01" [33m->[0m [0m"xlb-poc02"
      [33m~[0m [0m[1m[0mproject[0m[0m                         = "playground-s-11-28ca33cd" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mself_link[0m[0m                       = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/backendServices/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msession_affinity[0m[0m                = "NONE" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mtimeout_sec[0m[0m                     = 30 [33m->[0m [0m(known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m

      [31m-[0m [0mbackend {
          [31m-[0m [0m[1m[0mbalancing_mode[0m[0m               = "UTILIZATION" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mcapacity_scaler[0m[0m              = 1 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mgroup[0m[0m                        = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/zones/us-central1-a/instanceGroups/xlb-poc01" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_connections[0m[0m              = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_connections_per_endpoint[0m[0m = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_connections_per_instance[0m[0m = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_rate[0m[0m                     = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_rate_per_endpoint[0m[0m        = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_rate_per_instance[0m[0m        = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_utilization[0m[0m              = 0 [90m->[0m [0m[90mnull[0m[0m
        }
      [32m+[0m [0mbackend {
          [32m+[0m [0m[1m[0mbalancing_mode[0m[0m               = "UTILIZATION"
          [32m+[0m [0m[1m[0mcapacity_scaler[0m[0m              = 1
          [32m+[0m [0m[1m[0mgroup[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mmax_connections[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mmax_connections_per_endpoint[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_connections_per_instance[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate_per_endpoint[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate_per_instance[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mmax_utilization[0m[0m              = (known after apply)
        }

      [32m+[0m [0mcdn_policy {
          [32m+[0m [0m[1m[0mcache_mode[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mclient_ttl[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mdefault_ttl[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mmax_ttl[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mnegative_caching[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mserve_while_stale[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0msigned_url_cache_max_age_sec[0m[0m = (known after apply)

          [32m+[0m [0mcache_key_policy {
              [32m+[0m [0m[1m[0minclude_host[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0minclude_protocol[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0minclude_query_string[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mquery_string_blacklist[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mquery_string_whitelist[0m[0m = (known after apply)
            }

          [32m+[0m [0mnegative_caching_policy {
              [32m+[0m [0m[1m[0mcode[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mttl[0m[0m  = (known after apply)
            }
        }

      [32m+[0m [0mlog_config {
          [32m+[0m [0m[1m[0menable[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0msample_rate[0m[0m = (known after apply)
        }
    }

[1m  # google_compute_firewall.this[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_compute_firewall" "this" {
      [33m~[0m [0m[1m[0mcreation_timestamp[0m[0m      = "2021-11-06T15:49:00.808-07:00" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdestination_ranges[0m[0m      = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdirection[0m[0m               = "INGRESS" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mdisabled[0m[0m                = false [90m->[0m [0m[90mnull[0m[0m
      [32m+[0m [0m[1m[0menable_logging[0m[0m          = (known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                      = "projects/playground-s-11-28ca33cd/global/firewalls/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                    = "xlb-poc01" [33m->[0m [0m"xlb-poc02" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mnetwork[0m[0m                 = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/networks/default" [33m->[0m [0m"default"
      [33m~[0m [0m[1m[0mproject[0m[0m                 = "playground-s-11-28ca33cd" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mself_link[0m[0m               = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/firewalls/xlb-poc01" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0msource_service_accounts[0m[0m = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msource_tags[0m[0m             = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtarget_service_accounts[0m[0m = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtarget_tags[0m[0m             = [] [90m->[0m [0m[90mnull[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m


        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # google_compute_global_address.this[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_compute_global_address" "this" {
      [33m~[0m [0m[1m[0maddress[0m[0m            = "34.149.130.125" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0maddress_type[0m[0m       = "EXTERNAL" [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mcreation_timestamp[0m[0m = "2021-11-06T15:49:09.861-07:00" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                 = "projects/playground-s-11-28ca33cd/global/addresses/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m               = "xlb-poc01" [33m->[0m [0m"xlb-poc02" [31m# forces replacement[0m[0m
      [31m-[0m [0m[1m[0mprefix_length[0m[0m      = 0 [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mproject[0m[0m            = "playground-s-11-28ca33cd" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mself_link[0m[0m          = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/addresses/xlb-poc01" [33m->[0m [0m(known after apply)
    }

[1m  # google_compute_global_forwarding_rule.this[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_compute_global_forwarding_rule" "this" {
      [33m~[0m [0m[1m[0mid[0m[0m                    = "projects/playground-s-11-28ca33cd/global/forwardingRules/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mip_address[0m[0m            = "projects/playground-s-11-28ca33cd/global/addresses/xlb-poc01" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mlabel_fingerprint[0m[0m     = "42WmSpB8rSM=" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mlabels[0m[0m                = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mname[0m[0m                  = "xlb-poc01" [33m->[0m [0m"xlb-poc02" [31m# forces replacement[0m[0m
      [32m+[0m [0m[1m[0mnetwork[0m[0m               = (known after apply)
      [33m~[0m [0m[1m[0mproject[0m[0m               = "playground-s-11-28ca33cd" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mself_link[0m[0m             = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/forwardingRules/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mtarget[0m[0m                = "projects/playground-s-11-28ca33cd/global/targetHttpProxies/xlb-poc01" [33m->[0m [0m(known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # google_compute_health_check.this[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_compute_health_check" "this" {
      [33m~[0m [0m[1m[0mcreation_timestamp[0m[0m  = "2021-11-06T15:49:53.005-07:00" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                  = "projects/playground-s-11-28ca33cd/global/healthChecks/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                = "xlb-poc01" [33m->[0m [0m"xlb-poc02" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mproject[0m[0m             = "playground-s-11-28ca33cd" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mself_link[0m[0m           = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/healthChecks/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mtype[0m[0m                = "TCP" [33m->[0m [0m(known after apply)
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m [0mlog_config {
          [33m~[0m [0m[1m[0menable[0m[0m = false [33m->[0m [0m(known after apply)
        }

      [33m~[0m [0mtcp_health_check {
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # google_compute_instance.this[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_compute_instance" "this" {
      [33m~[0m [0m[1m[0mcpu_platform[0m[0m            = "Intel Broadwell" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mcurrent_status[0m[0m          = "RUNNING" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0menable_display[0m[0m          = false [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mguest_accelerator[0m[0m       = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                      = "projects/playground-s-11-28ca33cd/zones/us-central1-a/instances/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minstance_id[0m[0m             = "2723819243868698696" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mlabel_fingerprint[0m[0m       = "42WmSpB8rSM=" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mlabels[0m[0m                  = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmetadata[0m[0m                = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mmetadata_fingerprint[0m[0m    = "CNq-uCnC9ug=" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m        = (known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                    = "xlb-poc01" [33m->[0m [0m"xlb-poc02" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mproject[0m[0m                 = "playground-s-11-28ca33cd" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mresource_policies[0m[0m       = [] [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mself_link[0m[0m               = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/zones/us-central1-a/instances/xlb-poc01" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mtags[0m[0m                    = [] [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mtags_fingerprint[0m[0m        = "42WmSpB8rSM=" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mzone[0m[0m                    = "us-central1-a" [33m->[0m [0m(known after apply)
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m [0mboot_disk {
          [33m~[0m [0m[1m[0mdevice_name[0m[0m                = "persistent-disk-0" [33m->[0m [0m(known after apply)
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [33m~[0m [0m[1m[0msource[0m[0m                     = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/zones/us-central1-a/disks/xlb-poc01" [33m->[0m [0m(known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m

          [33m~[0m [0minitialize_params {
              [33m~[0m [0m[1m[0mimage[0m[0m  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20211105" [33m->[0m [0m"debian-cloud/debian-9"
              [33m~[0m [0m[1m[0mlabels[0m[0m = {} [33m->[0m [0m(known after apply)
              [33m~[0m [0m[1m[0msize[0m[0m   = 10 [33m->[0m [0m(known after apply)
              [33m~[0m [0m[1m[0mtype[0m[0m   = "pd-standard" [33m->[0m [0m(known after apply)
            }
        }

      [32m+[0m [0mconfidential_instance_config {
          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)
        }

      [33m~[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m   = (known after apply)
          [33m~[0m [0m[1m[0mname[0m[0m               = "nic0" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mnetwork[0m[0m            = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/networks/default" [33m->[0m [0m"default"
          [33m~[0m [0m[1m[0mnetwork_ip[0m[0m         = "10.128.0.4" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mstack_type[0m[0m         = "IPV4_ONLY" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0msubnetwork[0m[0m         = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/regions/us-central1/subnetworks/default" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0msubnetwork_project[0m[0m = "playground-s-11-28ca33cd" [33m->[0m [0m(known after apply)

          [33m~[0m [0maccess_config {
              [33m~[0m [0m[1m[0mnat_ip[0m[0m       = "35.225.15.143" [33m->[0m [0m(known after apply)
              [33m~[0m [0m[1m[0mnetwork_tier[0m[0m = "PREMIUM" [33m->[0m [0m(known after apply)
            }
        }

      [32m+[0m [0mreservation_affinity {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)

          [32m+[0m [0mspecific_reservation {
              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)
            }
        }

      [33m~[0m [0mscheduling {
          [33m~[0m [0m[1m[0mautomatic_restart[0m[0m   = true [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mmin_node_cpus[0m[0m       = 0 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mon_host_maintenance[0m[0m = "MIGRATE" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mpreemptible[0m[0m         = false [33m->[0m [0m(known after apply)

          [32m+[0m [0mnode_affinities {
              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
            }
        }
    }

[1m  # google_compute_instance_group.this[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_compute_instance_group" "this" {
      [33m~[0m [0m[1m[0mid[0m[0m        = "projects/playground-s-11-28ca33cd/zones/us-central1-a/instanceGroups/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minstances[0m[0m = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/zones/us-central1-a/instances/xlb-poc01",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m      = "xlb-poc01" [33m->[0m [0m"xlb-poc02" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mnetwork[0m[0m   = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/networks/default" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mproject[0m[0m   = "playground-s-11-28ca33cd" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mself_link[0m[0m = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/zones/us-central1-a/instanceGroups/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msize[0m[0m      = 1 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mzone[0m[0m      = "us-central1-a" [33m->[0m [0m(known after apply)

      [33m~[0m [0mnamed_port {
          [33m~[0m [0m[1m[0mname[0m[0m = "xlb-poc01" [33m->[0m [0m"xlb-poc02"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
    }

[1m  # google_compute_target_http_proxy.this[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_compute_target_http_proxy" "this" {
      [33m~[0m [0m[1m[0mcreation_timestamp[0m[0m = "2021-11-06T15:51:21.785-07:00" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                 = "projects/playground-s-11-28ca33cd/global/targetHttpProxies/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m               = "xlb-poc01" [33m->[0m [0m"xlb-poc02" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mproject[0m[0m            = "playground-s-11-28ca33cd" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mproxy_bind[0m[0m         = false [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mproxy_id[0m[0m           = 3056667651551705094 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mself_link[0m[0m          = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/targetHttpProxies/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0murl_map[0m[0m            = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/urlMaps/xlb-poc01" [33m->[0m [0m(known after apply)
    }

[1m  # google_compute_url_map.this[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_compute_url_map" "this" {
      [33m~[0m [0m[1m[0mcreation_timestamp[0m[0m = "2021-11-06T15:51:10.556-07:00" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdefault_service[0m[0m    = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/backendServices/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mfingerprint[0m[0m        = "7U_PmrEkKZ8=" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                 = "projects/playground-s-11-28ca33cd/global/urlMaps/xlb-poc01" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mmap_id[0m[0m             = 7001636838534985777 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m               = "xlb-poc01" [33m->[0m [0m"xlb-poc02" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mproject[0m[0m            = "playground-s-11-28ca33cd" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mself_link[0m[0m          = "https://www.googleapis.com/compute/v1/projects/playground-s-11-28ca33cd/global/urlMaps/xlb-poc01" [33m->[0m [0m(known after apply)
    }

[0m[1mPlan:[0m 9 to add, 0 to change, 9 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Nevana, Action: `pull_request`*